gitb-ui/repository/test-suites/IHE_XDSb_SharingOfDocument/artifacts/IHE/ihe-xdsb-request-ITI41.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing"
            xmlns:s="http://www.w3.org/2003/05/soap-envelope">
   <s:Header>
      <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</a:Action>
      <a:MessageID>urn:uuid:a2808b83-aab0-41bd-b42e-39ef0b96fbcb</a:MessageID>
      <a:ReplyTo>
         <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
      </a:ReplyTo>
      <a:To s:mustUnderstand="1">http://ihexds.nist.gov:12090/tf6/services/xdsrepositoryb?wsdl</a:To>
   </s:Header>
   <s:Body>
      <xdsb:ProvideAndRegisterDocumentSetRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"
                                                 xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
                                                 xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0"
                                                 xmlns:xdsb="urn:ihe:iti:xds-b:2007"
                                                 xmlns:xop="http://www.w3.org/2004/08/xop/include">
         <lcm:SubmitObjectsRequest>
            <rim:RegistryObjectList>
               <rim:RegistryPackage id="urn:uuid:a20ff1a4-3820-4832-9582-3bde4a74658c"
                                    objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
                  <rim:Slot name="submissionTime">
                    <rim:ValueList>
                        <rim:Value>20150514101328</rim:Value>
                    </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                    <rim:LocalizedString value="XDS Submission Set"/>
                  </rim:Name>
                  <rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500"
                                      classifiedObject="urn:uuid:a20ff1a4-3820-4832-9582-3bde4a74658c"
                                      id="urn:uuid:32279ac1-06a1-427f-aedd-cdb449f0efe2"
                                      nodeRepresentation="11488-4"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>2.16.840.1.113883.6.1</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="Consultation Note"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"
                                      classifiedObject="urn:uuid:a20ff1a4-3820-4832-9582-3bde4a74658c"
                                      id="urn:uuid:0f16bc09-6a9c-4046-bf10-95536006ed9a"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
                  <rim:ExternalIdentifier id="urn:uuid:5f5705db-f31c-4603-b359-6bf2b30f5610"
                                          identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:a20ff1a4-3820-4832-9582-3bde4a74658c"
                                          value="1.3.6.1.4.1.21367.2012.2.1.1">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
                  <rim:ExternalIdentifier id="urn:uuid:092faf7f-7cb6-481f-a6ae-0f9ecd690321"
                                          identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:a20ff1a4-3820-4832-9582-3bde4a74658c"
                                          value="1.3.6.1.4.1.12559.11.1.2.2.1.1.4.36756">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
                  <rim:ExternalIdentifier id="47a1ca6f-66a5-4bc4-a39c-bed1e0d713e7"
                                          identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:a20ff1a4-3820-4832-9582-3bde4a74658c"
                                          value="9be1413171a8492^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
               </rim:RegistryPackage>
               <rim:ExtrinsicObject id="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                    mimeType="text/plain"
                                    objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1"
                                    status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
                  <rim:Slot name="creationTime">
                    <rim:ValueList>
                        <rim:Value>20150514095600</rim:Value>
                    </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="languageCode">
                    <rim:ValueList>
                        <rim:Value>en-us</rim:Value>
                    </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="sourcePatientId">
                    <rim:ValueList>
                        <rim:Value>9be1413171a8492^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO</rim:Value>
                    </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                    <rim:LocalizedString value="XDSDocument Entry 1"/>
                  </rim:Name>
                  <rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a"
                                      classifiedObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                      id="urn:uuid:b25b3cd6-f2f7-451f-947c-cd422cc7c8b3"
                                      nodeRepresentation="DEMO-Pt Mgmt"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>1.3.6.1.4.1.21367.100.1</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="Patient Management"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f"
                                      classifiedObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                      id="urn:uuid:8fe086d2-dc6c-4e68-beee-dbfcd53ffe5d"
                                      nodeRepresentation="R"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>2.16.840.1.113883.5.25</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="Restricted"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d"
                                      classifiedObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                      id="urn:uuid:889dff26-0e1a-4b77-8a10-d3354ff3d632"
                                      nodeRepresentation="urn:ihe:lab:xd-lab:2008"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>1.3.6.1.4.1.19376.1.2.3</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="urn:ihe:lab:xd-lab:2008"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1"
                                      classifiedObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                      id="urn:uuid:cb48d75f-3646-452a-977b-8a964e01827d"
                                      nodeRepresentation="GYN"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>2.16.840.1.113883.5.11</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="Gynecology clinic"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead"
                                      classifiedObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                      id="urn:uuid:1f066918-060d-4754-87e1-23d77a45b3e2"
                                      nodeRepresentation="Psychiatry"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>Connect-a-thon practiceSettingCodes</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="Psychiatry"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983"
                                      classifiedObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                      id="urn:uuid:569d2f3d-ead3-42a5-bfed-780c855ac9bf"
                                      nodeRepresentation="TRS TYPECODE"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>1.3.6.1.4.1.21367.100.1</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="TRS Type Code"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:ExternalIdentifier id="urn:uuid:d25b48b7-4795-4507-94fc-6acf7c7f3ce3"
                                          identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                          value="1.3.6.1.4.1.12559.11.1.2.2.1.1.3.36757">
                    <rim:Name>
                        <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
                  <rim:ExternalIdentifier id="4371d182-83eb-4ae6-a805-c2e9d6cb2e28"
                                          identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49"
                                          value="9be1413171a8492^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO">
                    <rim:Name>
                        <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
               </rim:ExtrinsicObject>
               <rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember"
                                id="95bd6f0c-f2b7-43c1-9706-98a3a28c3b7b"
                                sourceObject="urn:uuid:a20ff1a4-3820-4832-9582-3bde4a74658c"
                                targetObject="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49">
                  <rim:Slot name="SubmissionSetStatus">
                    <rim:ValueList>
                        <rim:Value>Original</rim:Value>
                    </rim:ValueList>
                  </rim:Slot>
               </rim:Association>
            </rim:RegistryObjectList>
         </lcm:SubmitObjectsRequest>
         <xdsb:Document id="urn:uuid:18d13225-ba9d-47db-bb2b-53fba3a42a49">
            <xop:Include href="cid:1.urn:uuid:18D13225BA9D47DBBB2B53FBA3A42A49"/>
         </xdsb:Document>
      </xdsb:ProvideAndRegisterDocumentSetRequest>
   </s:Body>
</s:Envelope>